IBtaskR/WorkAround/XML/Documents/РеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РеализацияТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТипЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТипЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

IBtaskR/WorkAround/XML/AccumulationRegisters/ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

IBtaskR/WorkAround/XML/AccumulationRegisters/Взаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Взаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

IBtaskR/WorkAround/XML/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выручка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

IBtaskR/WorkAround/XML/Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

IBtaskR/WorkAround/XML/Documents/РеализацияТоваров/Ext/ObjectModule.bsl
Procedure Filling(FillingData, StandardProcessing)
	//{{__CREATE_BASED_ON_WIZARD
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	If TypeOf(FillingData) = Type("DocumentRef.ЗаказКлиента") Then
		// Заполнение шапки
		Заказ = FillingData.Ref;
		Покупатель = FillingData.Покупатель;
		Склад = FillingData.Склад;
		For Each CurRowТовары In FillingData.Товары Do
			If CurRowТовары.Номенклатура.ВидНоменклатуры = Enums.ВидыНоменклатуры.Товар Then
				NewRow = Товары.Add();
				NewRow.Количество = CurRowТовары.Количество;
				NewRow.Номенклатура = CurRowТовары.Номенклатура;
				NewRow.Сумма = CurRowТовары.Сумма;
				NewRow.Цена = CurRowТовары.Цена;
			EndIf;
		EndDo;
	EndIf;
	//}}__CREATE_BASED_ON_WIZARD
EndProcedure

Procedure Posting(Cancel, Mode)
	//{{__REGISTER_REGISTERRECORDS_WIZARD
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиНоменклатуры Expense
	RegisterRecords.ОстаткиНоменклатуры.Write = True;
	For Each CurRowТовары In Товары Do
		Record = RegisterRecords.ОстаткиНоменклатуры.Add();
		Record.RecordType = AccumulationRecordType.Expense;
		Record.Period = Date;
		Record.Номенклатура = CurRowТовары.Номенклатура;
		Record.Склад = Склад;
		Record.Количество = CurRowТовары.Количество;
	EndDo;

	// регистр Взаиморасчеты Receipt
	RegisterRecords.Взаиморасчеты.Write = True;
	For Each CurRowТовары In Товары Do
		Record = RegisterRecords.Взаиморасчеты.Add();
		Record.RecordType = AccumulationRecordType.Receipt;
		Record.Period = Date;
		Record.Контрагент = Покупатель;
		Record.Договор = Договор;
		Record.Сумма = Сумма;
	EndDo;

	// регистр Продажи 
	RegisterRecords.Продажи.Write = True;
	For Each CurRowТовары In Товары Do
		Record = RegisterRecords.Продажи.Add();
		Record.Period = Date;
		Record.Номенклатура = CurRowТовары.Номенклатура;
		Record.Контрагент = Покупатель;
		Record.Склад = Склад;
		Record.Количество = CurRowТовары.Количество;
		Record.Выручка = CurRowТовары.Сумма;
	EndDo;

	//}}__REGISTER_REGISTERRECORDS_WIZARD
	     	//{{QUERY_BUILDER_WITH_RESULT_PROCESSING
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	ОстаткиНоменклатурыBalance.Номенклатура AS Номенклатура,
		|	ОстаткиНоменклатурыBalance.Склад AS Склад,
		|	ОстаткиНоменклатурыBalance.КоличествоBalance AS КоличествоBalance
		|FROM
		|	AccumulationRegister.ОстаткиНоменклатуры.Balance(
		|			,
		|			Склад = &Склад
		|				AND Номенклатура IN
		|					(SELECT
		|						РеализацияТоваровТовары.Номенклатура AS Номенклатура
		|					FROM
		|						Document.РеализацияТоваров.Товары AS РеализацияТоваровТовары
		|					WHERE
		|						РеализацияТоваровТовары.Ref = &Ref)) AS ОстаткиНоменклатурыBalance
		|WHERE
		|	ОстаткиНоменклатурыBalance.КоличествоBalance < 0";
	
	Query.SetParameter("Ref", Ref);
	Query.SetParameter("Склад", Склад);
	
	QueryResult = Query.Execute();
	If NOT QueryResult.IsEmpty() Then 
		// Недостаточно товара
		Cancel = True;
		SelectionDetailRecords = QueryResult.Select();
	
		While SelectionDetailRecords.Next() Do
			Message("Недостаточно товара: " + SelectionDetailRecords.Номенклатура + " в количестве:" + (-SelectionDetailRecords.КоличествоBalance));
		EndDo;
	Else 
		Cancel = False;       
	EndIf;
	
	//}}QUERY_BUILDER_WITH_RESULT_PROCESSING

EndProcedure
